{
  "name": "russian",
  "label": "Русский",
  "locale": {
    "pages": {
      "DocsPageAPI": {
        "pageAbout": "API документация компонента React DocsPage. Узнайте больше о props и кастомизации CSS.",
        "pageSearchDescription": "DocsPage - реакт компонент, созданный для того, чтоб беспечивать пользователя функционалом страниц. ",
        "ComponentNameText": "Имя  DocsPage может быть использовано для для обемпеччения значений по умолчанию для props или переопределения стилей на уровне темы.",
        "props": {
          "name": "Название страницы. Route будет сгенерирован автоматически из имени.",
          "searchTags": "Ключевые слова для поиска.",
          "searchLabel": "Название страницы, которое будет показано в поиске, если страница будет соответствовать условиям поиска.",
          "searchDescription": "Описание, которое будет показываться вместе с названием страницы, когда она будет соответствовать условиям поиска.",
          "noGenerateAutoSearch": "Если true, страница не будет генерировать информацию для поиска.",
          "noAutoMenu": "Если true, страница не будет участвовать в автоматическом создании меню."
        },
        "css": {
          "root": "Стили, примеённые к корневому компоненту.",
          "contentItem": "Стили, применённые к элементу item панели содержания.",
          "contentItemActive": "Стили, применённые к компоненту item панели соержания, если она отображается.",
          "contentLink": "Стили, применённые к компоненту link элемента item панели содержания.",
          "copyright": "Стили, применённые к панели copyright, если она отображается."
        }
      }
    },
    "common": {
      "spells": {
        "Props": "Props",
        "Import": "Импорт"
      },
      "ComponentAPI": {
        "importDifferenceText": {
          "text1": "Вы можете узнать больше о разнице, ",
          "link1": "прочитав этот гайд",
          "text2": "."
        },
        "customizationText": "Вы можете переопределить стиль компонента следующими способами:",
        "customizationRule": "С помощью имени правила в ",
        "customizationClass": "С помощью",
        "customizationTheme": "С помощью темы и",
        "customizationFooterText": "Если этого недостаточно, Вы можете посмотреть реализацию кода для большей инфрмации.",
        "ruleName": "Название правила",
        "ruleDescription": "Описание",
        "propName": "Название",
        "propType": "Тип",
        "propDefault": "По умолчанию",
        "propDescription": "Описание",
        "ComponentNameHeader": "Имя компонента"
      }
    }
  }
}